<!--<template>-->
<!--	<div id="challenges">-->

<!--	</div>-->
<!--</template>-->

<!--<script>-->
<!--	import {-->
<!--		AddChallenge-->
<!--	} from '@/api/api.js'-->
<!--  import BmapScatter from "./charts/BmapScatter";-->




<!--	export default {-->
<!--		components: {-->
<!--      BmapScatter : BmapScatter-->
<!--		},-->
<!--		name: "challenges",-->
<!--		data: () => {-->
<!--			return {-->
<!--				reload: true,-->
<!--				user: {},-->
<!--				challengeType: 'Pwn',-->
<!--				// 表单value-->
<!--				showDialog: false,-->
<!--				title: '',-->
<!--				type: '',-->
<!--				flag: '',-->
<!--				des: '',-->
<!--				score: 500-->
<!--			}-->
<!--		},-->
<!--		methods: {-->

<!--		},-->
<!--		computed: {-->
<!--			role: function() {-->
<!--				return this.$store.state.user.role-->
<!--			}-->
<!--		},-->
<!--		watch: {-->
<!--			$route: function(to, from) {-->
<!--				if (to.path == '/challenges') {-->
<!--					//重新渲染子组件-->
<!--					this.ReloadSelf();-->
<!--				}-->
<!--			}-->
<!--		},-->
<!--	}-->
<!--</script>-->

<!--<style scoped>-->
<!--	.form-dialog {-->
<!--		max-width: 500px;-->
<!--	}-->

<!--	.container {-->
<!--		text-align: center;-->
<!--		margin: 0 auto;-->
<!--		/* 		margin-right: 16%; */-->
<!--		max-width: 85%;-->
<!--	}-->
<!--	.title {-->
<!--		margin: 0 auto;-->
<!--		max-width: 65%;-->
<!--	}-->
<!--</style>-->

<template>
  <div class="container1">
      <div class="left">
        <div class="left-top" style="border: 2px solid black">
          <p style="margin-left: 10px"> 选择区域类型</p>
          <el-select style="margin-left: 5px" v-model="areatype" placeholder="请选择区域">
            <el-option
                v-for="item in areaoption"
                :key="item.value"
                :label="item.label"
                :value="item.value">
            </el-option>
          </el-select>
        <p style="margin-left: 10px"> 选择你想查看的区域</p>
        <el-select v-if="areatype === '1'" style="margin-left: 5px" v-model="value" placeholder="请选择区域">
          <el-option
              v-for="item in stopeoptions"
              :key="item.value"
              :label="item.label"
              :value="item.value">
          </el-option>
        </el-select>
         <el-select v-if="areatype === '2'" style="margin-left: 5px" v-model="value" placeholder="请选择区域">
            <el-option
                v-for="item in slagyardoptions"
                :key="item.value"
                :label="item.label"
                :value="item.value">
            </el-option>
          </el-select>
          <p> </p>
        <el-button style="margin-left: 20px   " type="primary" icon="el-icon-search" @click="changemapcenter()">搜索</el-button>
          <el-button style="margin-left: 20px   " type="primary" icon="el-icon-search" @click="showallarea()">搜索全部区域</el-button>
          <el-button style="margin-left: 20px   " type="primary" icon="el-icon-search" @click="showallcar()">所有车辆目前位置</el-button>
          <el-button style="margin-left: 20px   " type="primary" icon="el-icon-search" @click="showsinglecar()">单辆车轨迹</el-button>
      </div>
      </div>

      <div class="date">
        <p style="height: 40px;font-size: 18px;margin-top: 5px"> {{this.datetime}}</p>
      </div>
      <div class="bmap" id="bmap" ref="bmap"></div>
  </div>
</template>

<script>
// 这个必须引入,否则不能识别bmap属性
import echarts from 'echarts'
import "echarts/extension/bmap/bmap"
import {Search, SearchCar} from "../../api/api";
import Vue from "vue";

var global_option;
var global_charts;
export default {
  name: 'challenges',
  data(){
    return{
      //搜索的终端号
      terminal:'0',
      //当前日期和时间
      datetime: null,
      //区域类型
      areatype:'',
      //采场区域
      stopearea:[],
      //渣场区域
      slagyardarea:[],
      areaoption: [{
        value: '1',
        label: '采场'
      }, {
        value: '2',
        label: '渣场'
      },
      ],
      value:'',
      //采场
      stopeoptions:[
        {
          value: '1',
          label: '利达采坑'
        }, {
          value: '2',
          label: '蒙西北采区'
        },
        {
          value: '3',
          label: '蒙西南采区'
        },
      ],
      //渣场选择
      slagyardoptions:[
        {
          value: '1',
          label: '利达东渣场'
        }, {
          value: '2',
          label: '利达煤场'
        },
        {
          value: '3',
          label: '利达排渣场'
        },
        {
          value: '4',
          label: '利达西渣场'
        },
        {
          value: '5',
          label: '蒙西煤场'
        },
        {
          value: '6',
          label: '蒙西排土场1'
        },
        {
          value: '7',
          label: '蒙西排土场2'
        },
        {
          value: '8',
          label: '蒙西排土场3'
        },
        {
          value: '9',
          label: '蒙西排土场4'
        },
      ],

      stopeareas:[
          //利达采坑
          [[106.93328130522411,39.47386315244423], [106.93528591389676,39.47308331359599], [106.93558002636611,39.47234545795724], [106.93547166914055,39.47073774518093], [106.9353913188517,39.470431795597676], [106.93582483034564,39.469644322307936], [106.9365670736119,39.4683526664651], [106.9367500924995,39.467012865038235], [106.9375533420616,39.46646117453912], [106.93967157860747,39.46445823047036], [106.94313265779039,39.465028145693694], [106.94430974405509,39.46563321920717], [106.94447081901762,39.46854326058364], [106.94432213443682,39.46923786471333], [106.94382651916747,39.46989091987866], [106.94301419554338,39.471726827036115], [106.94275399752698,39.47358987148918], [106.94080971381513,39.47393747936455], [106.94015302358324,39.47395668564973], [106.93959545640523,39.47434081023106], [106.93460105434576,39.47441544303832], [106.93349831037146,39.47424258742824]],
        // //蒙西北采区
       [[107.04041904480762,39.65114357561267], [107.03705880717436,39.64679062417564], [107.03614539043457,39.64543895052591], [107.03191833893139,39.64616219543931], [107.02952762947469,39.64921581211213], [107.03091354800034,39.657628697492214], [107.03453349076958,39.6620612208715], [107.03958543843864,39.66259717292914], [107.04250764346288,39.66125728492871], [107.04518220399356,39.658615714739206], [107.04513267509485,39.65494031734131], [107.04354775033592,39.651839047546645], [107.04032837191936,39.65111156889202]],
        // //蒙西南采区
        [[107.02250795943631,39.63531041501741], [107.02385692436292,39.636233119320856], [107.0263992044169,39.636874993257535], [107.02894148447089,39.636393588367945], [107.03132811472565,39.63575170992792], [107.04061521941266,39.63282306335316], [107.04424704806124,39.62688536566895], [107.0406671026791,39.622070464002725], [107.02380504109655,39.62355509469528], [107.02058827857927,39.624718701712546], [107.02250795943635,39.635110041384415]]

      ],
      slagyardareas:[
        //利达东渣场
        [[106.9445581367628,39.46553978194375], [106.94457077701112,39.46583372115703], [106.94468949570219,39.46825747067865], [106.94455523527796,39.46923576392724], [106.94342344555764,39.47190477444357], [106.94356079521695,39.47359836788914], [106.94936072366787,39.473956103776274], [106.95378935879339,39.473449303851694], [106.95717771050015,39.47256751203145], [106.95806938200192,39.4690888767586], [106.95673187474925,39.465909573308195], [106.95479731001649,39.464408652893816], [106.94876366618776,39.46415521834356], [106.94469169966294,39.465399342663204]],
        //利达煤场
        [[106.9334049552812,39.470530834676794], [106.93354675275577,39.469585642519625], [106.93390124644218,39.46786008391867], [106.93479457053189,39.46806891177621], [106.93500726674374,39.46816783001452], [106.93490800851154,39.468563501550236], [106.93476621103699,39.469420782096755], [106.93461023381496,39.47050885361083], [106.93459542740506,39.47058791229157], [106.93400586054396,39.470581091918795], [106.93344855853596,39.47056972462934], [106.93340749417747,39.47056063079642]],
        //利达排渣场
        [[106.94022939015291,39.47474585684117], [106.94037848760337,39.47408718240309], [106.94070650199441,39.47404673727657], [106.94095251278769,39.474220073366126], [106.94106433587555,39.47457829990489], [106.94078105071965,39.47476896811081], [106.94040830709346,39.47479785718694], [106.94028157426057,39.47474007902256]],
        //利达西渣场
        [[106.92520965567516,39.47603722956842], [106.92388318505208,39.47679473408092], [106.92297559988891,39.47690294833247], [106.92048555854383,39.47585687012555], [106.91985723035394,39.474522195597096], [106.9218585719958,39.473692520041965], [106.92404608495316,39.4740352133282], [106.92486058445856,39.474684522256425], [106.92518638426073,39.475820798180386]],
        //蒙西煤场
        [[107.03782209804757,39.64668777866282], [107.03809296336479,39.64521556649449], [107.03897943167568,39.645094995994654], [107.03979202762734,39.64513941672978], [107.04094115321554,39.64532979098305], [107.04099040145502,39.64648471679405], [107.04087548889619,39.64691906883877], [107.0399479803857,39.646957142743844], [107.03896301559583,39.64687464925612], [107.03798625884585,39.64672235332583], [107.03784672216729,39.64669062496444]],
        //蒙西排土场1
        [[107.021621173599,39.64635448822788], [107.02270498771657,39.64679001601012], [107.02434013926182,39.646506567879946], [107.02545030019598,39.64533352254567], [107.02247334765661,39.64219476627665], [107.02162836126622,39.64634700744285]],
        //蒙西排土场2
        [[107.02247625236016,39.642176213342864], [107.0239999499199,39.637407397728204], [107.02593444576544,39.638223847518546], [107.02752547236783,39.641838885204955], [107.02843075441056,39.644789036597125], [107.0254370937758,39.64533562504735], [107.02246819216252,39.642191583326316]],
        //蒙西排土场3
        [[107.02247363241547,39.642183841117834], [107.02399271570545,39.63740948075738], [107.02209082205137,39.635817258057614], [107.02031301914963,39.63649786884222], [107.0200889805139,39.6364671342952], [107.01880799181025,39.64036171554092], [107.02078006736104,39.64177339780462], [107.02246651993266,39.64218338923799]],
        //蒙西排土场4
        [[107.02843756365753,39.64478307726629], [107.03114999915857,39.642333455622705], [107.03539451063823,39.63966228045286], [107.03539793742887,39.63966228045286], [107.03544139690264,39.6372191478858], [107.03376059806139,39.63676106375936], [107.03124999048467,39.63754742414876], [107.02976615106974,39.638344706932365], [107.02898294562256,39.63966430237051], [107.02882646030632,39.640994318161034], [107.02753601738132,39.64184664046424], [107.02753210978065,39.64184361926661], [107.02843987652169,39.644792278349]]

      ],
      area:
        [[106.93328130522411,39.47386315244423], [106.93528591389676,39.47308331359599], [106.93558002636611,39.47234545795724], [106.93547166914055,39.47073774518093], [106.9353913188517,39.470431795597676], [106.93582483034564,39.469644322307936], [106.9365670736119,39.4683526664651], [106.9367500924995,39.467012865038235], [106.9375533420616,39.46646117453912], [106.93967157860747,39.46445823047036], [106.94313265779039,39.465028145693694], [106.94430974405509,39.46563321920717], [106.94447081901762,39.46854326058364], [106.94432213443682,39.46923786471333], [106.94382651916747,39.46989091987866], [106.94301419554338,39.471726827036115], [106.94275399752698,39.47358987148918], [106.94080971381513,39.47393747936455], [106.94015302358324,39.47395668564973], [106.93959545640523,39.47434081023106], [106.93460105434576,39.47441544303832], [106.93349831037146,39.47424258742824]]

      ,
      areacenter:[106.93328130522411,39.47386315244423],
      mapcenter:[106.93328130522411,39.47386315244423],
      mapcentertest:[106.94469169966294, 39.465399342663204],
      lidacaikengcenter:[106.9445581367628,39.46553978194375],
      lidacaikeng: [ [106.9445581367628,39.46553978194375], [106.94457077701112,39.46583372115703], [106.94468949570219,39.46825747067865], [106.94455523527796,39.46923576392724], [106.94342344555764,39.47190477444357], [106.94356079521695,39.47359836788914], [106.94936072366787,39.473956103776274], [106.95378935879339,39.473449303851694], [106.95717771050015,39.47256751203145], [106.95806938200192,39.4690888767586], [106.95673187474925,39.465909573308195], [106.95479731001649,39.464408652893816], [106.94876366618776,39.46415521834356], [106.94469169966294,39.465399342663204]],
      coord:[],
      data:[],
      geoCoordMap:{}
    }
  },
  mounted () {
    this.initarea();
    setInterval(()=>{
      this.datetime = this.getdatetime();
      // if(global_option)
      // {   global_charts.setOption(global_option);
      //     console.log("gengxin");
      // }
    }, 1000)
  },
  beforeCreate() {

    // await SearchCar(this, this.terminal)
    //     .then(rsp => {
    //       // Vue.set(this.tableData, value, rsp.data.data)
    //       // this.tableData[value] = rsp.data.data;
    //       // console.log(this.tableData[value]);
    //     });

    // setInterval(()=>{
    //   // this.datetime = this.getdatetime();
    //   // if(global_option)
    //   // {   global_charts.setOption(global_option);
    //   //     console.log("gengxin");
    //   // }
    // }, 1000)

    // setInterval(()=>{
    //   global_charts.setOption(global_option);
    // }, 1000)
    // global_charts.setOption(global_option);
  },
  methods: {
    async showsinglecar() {
      this.terminal = '11650245350';
      await SearchCar(this, this.terminal)
          .then(rsp => {
            console.log(rsp);


            // Vue.set(this.tableData, value, rsp.data.data)
            // this.tableData[value] = rsp.data.data;
            // console.log(this.tableData[value]);
          });
    },
    async showallcar() {
      await SearchCar(this, this.terminal)
          .then(rsp => {
            console.log(rsp);
            this.data = rsp.data.data;
            this.geoCoordMap = rsp.data.coordmap;

            console.log(this.data)
            console.log(this.geoCoordMap)

            // Vue.set(this.tableData, value, rsp.data.data)
            // this.tableData[value] = rsp.data.data;
            // console.log(this.tableData[value]);
          });
      this.initarea();
    },
    getdatetime() {
      const d = new Date()
      const year = d.getFullYear();
      const month = d.getMonth() + 1 < 10 ? "0" + (d.getMonth() + 1) : d.getMonth() + 1;
      const date = d.getDate() < 10 ? "0" + d.getDate() : d.getDate();
      const hour = d.getHours() < 10 ? "0" + d.getHours() : d.getHours();
      const minute = d.getMinutes() < 10 ? "0" + d.getMinutes() : d.getMinutes();
      const second= d.getSeconds() < 10 ? "0" + d.getSeconds() : d.getSeconds();
      return year+'-'+month+'-'+date+' '+hour+':'+minute+':'+second;
    },
    showallarea(){

      // global_option = null;
      this.initarea();
      console.log(global_option);
      var data = this.stopeareas;
      for( let i = 0; i <this.stopeareas.length; i++) {
        let j = i;
        global_option.series.push({
          type: 'custom',
          coordinateSystem: 'bmap',
          // eslint-disable-next-line no-undef
          renderItem: function renderItem(params, api) {
            var coords = data[j];
            // console.log(coords);
          // [
          // [116.7,39.53],
          // [103.73,36.03],
          // [112.91,27.87],
          // [120.65,28.01],
          // [119.57,39.95]]

            var points = [];
            for (var i = 0; i < coords.length; i++) {
              points.push(api.coord(coords[i]));
            }
            // var color = api.visual('color');
            var color = 'red';

          return {
            type: 'polygon',
            shape: {
              points: echarts.graphic.clipPointsByRect(points, {
                x: params.coordSys.x,
                y: params.coordSys.y,
                width: params.coordSys.width,
                height: params.coordSys.height
              })
            },
            style: api.style({
              fill: color,
              stroke: echarts.color.lift(color)
            }),
          };
        },
          itemStyle: {
            opacity: 0.5
          },
          animation: false,
          silent: true,
          data: [0],
          z: -10,
          label:{
            show:true,
            formatter: (params) => {
              // params.data.name 城市名称
              // params.data.value[2] 空气质量指数数据
              return '采坑'
              // return `${params.name} - ${params.type}`
            }
          },
        });

        // global_charts.setOption(global_option);
      }


      var data1 = this.slagyardareas;
      for( let i = 0; i <this.slagyardareas.length; i++) {
        let j = i;
        global_option.series.push({
          type: 'custom',
          coordinateSystem: 'bmap',
          // eslint-disable-next-line no-undef
          renderItem: function renderItem(params, api) {
            var coords = data1[j];
            var points = [];
            for (var i = 0; i < coords.length; i++) {
              points.push(api.coord(coords[i]));
            }
            var color = 'black';

            return {
              type: 'polygon',
              shape: {
                points: echarts.graphic.clipPointsByRect(points, {
                  x: params.coordSys.x,
                  y: params.coordSys.y,
                  width: params.coordSys.width,
                  height: params.coordSys.height
                })
              },
              style: api.style({
                fill: color,
                stroke: echarts.color.lift(color)
              })
            };
          },
          itemStyle: {
            opacity: 0.5
          },
          animation: false,
          silent: true,
          data: [0],
          z: -10
        });

        // global_charts.setOption(global_option);
      }
      console.log(global_option);
      // global_charts.setOption(global_option);
      // document.getElementById('bmap').innerHTML = "";

      var myChart = this.$echarts.init(global_charts);
      myChart.setOption(global_option);

    },
    renderItem(params, api) {
        var coords = this.area;
            // this.coord;
        // [
        // [116.7,39.53],
        // [103.73,36.03],
        // [112.91,27.87],
        // [120.65,28.01],
        // [119.57,39.95]]

        var points = [];
        for (var i = 0; i < coords.length; i++) {
          points.push(api.coord(coords[i]));
        }
        var color = api.visual('color');

        return {
          type: 'polygon',
          shape: {
            points: echarts.graphic.clipPointsByRect(points, {
              x: params.coordSys.x,
              y: params.coordSys.y,
              width: params.coordSys.width,
              height: params.coordSys.height
            })
          },
          style: api.style({
            fill: color,
            stroke: echarts.color.lift(color)
          }),

        };
      },


    changemapcenter(){
      //选择有问题 提醒
      if(this.areatype === '' || this.value ===''){

        this.$alert('请选择区域进行查询', '警告', {
          confirmButtonText: '确定',
          callback: action => {
            this.$message({
              type: 'info',
              message: `action: ${ action }`
            });
          }
        });
        return;
      }
      document.getElementById('bmap').innerHTML = "";

      if(this.areatype === '1') {
        this.area = this.stopeareas[parseInt(this.value) - 1 ];
        this.areacenter = this.area[0];
      }
      else {
        this.area = this.slagyardareas[parseInt(this.value) - 1 ];
        this.areacenter = this.area[0];
      }
      // this.area = this.lidacaikeng;
      // this.areacenter = this.lidacaikengcenter;
      // this.mapcenter = this.mapcentertest;
      this.initarea();
      global_option.series = [];
      console.log(global_option);
      global_option.series.push({
        type: 'custom',
            coordinateSystem: 'bmap',
        // eslint-disable-next-line no-undef
          renderItem:  this.renderItem,
          itemStyle: {
        opacity: 0.5
      },
        animation: false,
            silent: true,
          data: [0],
          z: -10
      });
      console.log(global_option);


      //清除  之前的series 数据
      document.getElementById("bmap").removeAttribute("_echarts_instance_");
      var chartDom = document.getElementById("bmap");
      var myChart = this.$echarts.init(chartDom);

      myChart.setOption(global_option);
    },




    initarea(){

      var data1 =[[{'coord': [107.00836, 39.425373], 'time': '2022-03-04 17:05:34'}, {'coord': [107.0085, 39.42551], 'time': '2022-03-04 17:05:40'}, {'coord': [107.00869, 39.42562], 'time': '2022-03-04 17:05:45'}, {'coord': [107.00876, 39.425808], 'time': '2022-03-04 17:05:50'}, {'coord': [107.00872, 39.425995], 'time': '2022-03-04 17:05:55'}, {'coord': [107.00864, 39.42616], 'time': '2022-03-04 17:06:00'}, {'coord': [107.00855, 39.42629], 'time': '2022-03-04 17:06:05'}, {'coord': [107.00844, 39.4264], 'time': '2022-03-04 17:06:10'}, {'coord': [107.00829, 39.426495], 'time': '2022-03-04 17:06:15'}, {'coord': [107.008125, 39.426582], 'time': '2022-03-04 17:06:20'}, {'coord': [107.007965, 39.426662], 'time': '2022-03-04 17:06:25'}, {'coord': [107.00779, 39.426743], 'time': '2022-03-04 17:06:30'}, {'coord': [107.00763, 39.426815], 'time': '2022-03-04 17:06:35'}, {'coord': [107.00747, 39.42689], 'time': '2022-03-04 17:06:40'}, {'coord': [107.0073, 39.42698], 'time': '2022-03-04 17:06:45'}, {'coord': [107.00713, 39.427055], 'time': '2022-03-04 17:06:50'}, {'coord': [107.0069, 39.427174], 'time': '2022-03-04 17:06:55'}, {'coord': [107.00661, 39.427353], 'time': '2022-03-04 17:07:00'}, {'coord': [107.006294, 39.427567], 'time': '2022-03-04 17:07:05'}, {'coord': [107.00595, 39.427814], 'time': '2022-03-04 17:07:10'}, {'coord': [107.00557, 39.428074], 'time': '2022-03-04 17:07:15'}, {'coord': [107.00518, 39.42834], 'time': '2022-03-04 17:07:20'}, {'coord': [107.00481, 39.42859], 'time': '2022-03-04 17:07:25'}, {'coord': [107.00439, 39.42885], 'time': '2022-03-04 17:07:30'}, {'coord': [107.00395, 39.4291], 'time': '2022-03-04 17:07:35'}, {'coord': [107.00348, 39.42933], 'time': '2022-03-04 17:07:40'}, {'coord': [107.002975, 39.429523], 'time': '2022-03-04 17:07:45'}, {'coord': [107.00235, 39.429714], 'time': '2022-03-04 17:07:51'}, {'coord': [107.0018, 39.429825], 'time': '2022-03-04 17:07:56'}, {'coord': [107.00123, 39.429924], 'time': '2022-03-04 17:08:01'}, {'coord': [107.00063, 39.430008], 'time': '2022-03-04 17:08:06'}, {'coord': [107.00008, 39.430088], 'time': '2022-03-04 17:08:11'}, {'coord': [106.9996, 39.43017], 'time': '2022-03-04 17:08:16'}, {'coord': [106.99918, 39.43028], 'time': '2022-03-04 17:08:21'}, {'coord': [106.99875, 39.430363], 'time': '2022-03-04 17:08:26'}, {'coord': [106.998344, 39.430496], 'time': '2022-03-04 17:08:31'}, {'coord': [106.99802, 39.43068], 'time': '2022-03-04 17:08:36'}, {'coord': [106.99783, 39.430912], 'time': '2022-03-04 17:08:41'}, {'coord': [106.99772, 39.43114], 'time': '2022-03-04 17:08:46'}, {'coord': [106.99765, 39.431423], 'time': '2022-03-04 17:08:51'}, {'coord': [106.99768, 39.431705], 'time': '2022-03-04 17:08:56'}, {'coord': [106.99787, 39.431904], 'time': '2022-03-04 17:09:01'}, {'coord': [106.9981, 39.432064], 'time': '2022-03-04 17:09:06'}, {'coord': [106.99835, 39.432247], 'time': '2022-03-04 17:09:11'}, {'coord': [106.9987, 39.43235], 'time': '2022-03-04 17:09:16'}, {'coord': [106.9991, 39.432476], 'time': '2022-03-04 17:09:21'}, {'coord': [106.99945, 39.43259], 'time': '2022-03-04 17:09:26'}, {'coord': [106.9998, 39.432743], 'time': '2022-03-04 17:09:31'}, {'coord': [107.00013, 39.43292], 'time': '2022-03-04 17:09:36'}, {'coord': [107.00048, 39.43303], 'time': '2022-03-04 17:09:41'}, {'coord': [107.00084, 39.433086], 'time': '2022-03-04 17:09:46'}, {'coord': [107.0012, 39.433064], 'time': '2022-03-04 17:09:51'}, {'coord': [107.00157, 39.432987], 'time': '2022-03-04 17:09:56'}, {'coord': [107.001854, 39.432922], 'time': '2022-03-04 17:10:01'}, {'coord': [107.002106, 39.4329], 'time': '2022-03-04 17:10:07'}, {'coord': [107.00235, 39.43288], 'time': '2022-03-04 17:10:12'}, {'coord': [107.002594, 39.432865], 'time': '2022-03-04 17:10:17'}, {'coord': [107.002785, 39.43278], 'time': '2022-03-04 17:10:22'}, {'coord': [107.00298, 39.43264], 'time': '2022-03-04 17:10:27'}, {'coord': [107.00309, 39.432484], 'time': '2022-03-04 17:10:32'}, {'coord': [107.003174, 39.43232], 'time': '2022-03-04 17:10:37'}, {'coord': [107.00331, 39.432148], 'time': '2022-03-04 17:10:42'}, {'coord': [107.003494, 39.43204], 'time': '2022-03-04 17:10:47'}, {'coord': [107.00362, 39.431995], 'time': '2022-03-04 17:10:52'}, {'coord': [107.00374, 39.431957], 'time': '2022-03-04 17:10:57'}, {'coord': [107.00385, 39.43192], 'time': '2022-03-04 17:11:02'}, {'coord': [107.00397, 39.43189], 'time': '2022-03-04 17:11:07'}, {'coord': [107.00409, 39.431854], 'time': '2022-03-04 17:11:12'}, {'coord': [107.00422, 39.431812], 'time': '2022-03-04 17:11:17'}, {'coord': [107.00433, 39.431755], 'time': '2022-03-04 17:11:22'}, {'coord': [107.00446, 39.4317], 'time': '2022-03-04 17:11:27'}, {'coord': [107.004585, 39.431644], 'time': '2022-03-04 17:11:32'}, {'coord': [107.004715, 39.43161], 'time': '2022-03-04 17:11:37'}, {'coord': [107.004814, 39.431698], 'time': '2022-03-04 17:11:42'}, {'coord': [107.004776, 39.431763], 'time': '2022-03-04 17:11:47'}, {'coord': [107.004776, 39.431763], 'time': '2022-03-04 17:11:52'}, {'coord': [107.004776, 39.431717], 'time': '2022-03-04 17:11:57'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:03'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:08'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:13'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:18'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:23'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:28'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:33'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:38'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:43'}, {'coord': [107.0048, 39.43168], 'time': '2022-03-04 17:12:48'}, {'coord': [107.00477, 39.431664], 'time': '2022-03-04 17:12:53'}, {'coord': [107.00462, 39.43169], 'time': '2022-03-04 17:12:58'}, {'coord': [107.00437, 39.431774], 'time': '2022-03-04 17:13:03'}, {'coord': [107.004074, 39.43191], 'time': '2022-03-04 17:13:08'}, {'coord': [107.00382, 39.432034], 'time': '2022-03-04 17:13:13'}, {'coord': [107.003555, 39.432163], 'time': '2022-03-04 17:13:18'}, {'coord': [107.00329, 39.43236], 'time': '2022-03-04 17:13:23'}, {'coord': [107.003105, 39.432545], 'time': '2022-03-04 17:13:28'}, {'coord': [107.00299, 39.432755], 'time': '2022-03-04 17:13:33'}, {'coord': [107.00287, 39.432976], 'time': '2022-03-04 17:13:38'}, {'coord': [107.00255, 39.433113], 'time': '2022-03-04 17:13:43'}, {'coord': [107.002174, 39.433186], 'time': '2022-03-04 17:13:48'}, {'coord': [107.001755, 39.433216], 'time': '2022-03-04 17:13:53'}, {'coord': [107.00132, 39.433235], 'time': '2022-03-04 17:13:58'}, {'coord': [107.000916, 39.433224], 'time': '2022-03-04 17:14:03'}, {'coord': [107.00046, 39.433136], 'time': '2022-03-04 17:14:09'}, {'coord': [107.00015, 39.433056], 'time': '2022-03-04 17:14:14'}, {'coord': [106.99988, 39.43292], 'time': '2022-03-04 17:14:19'}, {'coord': [106.999535, 39.43277], 'time': '2022-03-04 17:14:24'}, {'coord': [106.9992, 39.43264], 'time': '2022-03-04 17:14:29'}, {'coord': [106.99886, 39.43253], 'time': '2022-03-04 17:14:34'}, {'coord': [106.99851, 39.432407], 'time': '2022-03-04 17:14:39'}, {'coord': [107.00068, 39.43006], 'time': '2022-03-04 17:15:49'}, {'coord': [107.00116, 39.42999], 'time': '2022-03-04 17:15:54'}, {'coord': [107.0017, 39.429905], 'time': '2022-03-04 17:15:59'}, {'coord': [107.0022, 39.42978], 'time': '2022-03-04 17:16:04'}, {'coord': [107.00269, 39.42964], 'time': '2022-03-04 17:16:09'}, {'coord': [107.003204, 39.429462], 'time': '2022-03-04 17:16:14'}, {'coord': [107.00381, 39.429207], 'time': '2022-03-04 17:16:20'}, {'coord': [107.00425, 39.428963], 'time': '2022-03-04 17:16:25'}, {'coord': [107.00467, 39.42871], 'time': '2022-03-04 17:16:30'}, {'coord': [107.00509, 39.428444], 'time': '2022-03-04 17:16:35'}, {'coord': [107.00546, 39.428196], 'time': '2022-03-04 17:16:40'}, {'coord': [107.00584, 39.42794], 'time': '2022-03-04 17:16:45'}, {'coord': [107.00621, 39.42768], 'time': '2022-03-04 17:16:50'}, {'coord': [107.00656, 39.42747], 'time': '2022-03-04 17:16:55'}, {'coord': [107.00686, 39.42742], 'time': '2022-03-04 17:17:00'}, {'coord': [107.00712, 39.427444], 'time': '2022-03-04 17:17:05'}, {'coord': [107.00742, 39.42754], 'time': '2022-03-04 17:17:10'}, {'coord': [107.00767, 39.42766], 'time': '2022-03-04 17:17:15'}, {'coord': [107.00792, 39.427814], 'time': '2022-03-04 17:17:20'}, {'coord': [107.0083, 39.42792], 'time': '2022-03-04 17:17:25'}, {'coord': [107.008705, 39.427963], 'time': '2022-03-04 17:17:30'}, {'coord': [107.00911, 39.428], 'time': '2022-03-04 17:17:35'}, {'coord': [107.009476, 39.428055], 'time': '2022-03-04 17:17:40'}, {'coord': [107.00978, 39.428104], 'time': '2022-03-04 17:17:45'}, {'coord': [107.010025, 39.428135], 'time': '2022-03-04 17:17:50'}, {'coord': [107.01025, 39.428158], 'time': '2022-03-04 17:17:55'}, {'coord': [107.01045, 39.428158], 'time': '2022-03-04 17:18:00'}, {'coord': [107.01063, 39.42815], 'time': '2022-03-04 17:18:05'}, {'coord': [107.0108, 39.428173], 'time': '2022-03-04 17:18:10'}, {'coord': [107.011024, 39.428196], 'time': '2022-03-04 17:18:16'}, {'coord': [107.01121, 39.42822], 'time': '2022-03-04 17:18:21'}, {'coord': [107.01138, 39.428207], 'time': '2022-03-04 17:18:26'}, {'coord': [107.01163, 39.428123], 'time': '2022-03-04 17:18:31'}, {'coord': [107.01193, 39.428043], 'time': '2022-03-04 17:18:36'}, {'coord': [107.01229, 39.42804], 'time': '2022-03-04 17:18:41'}, {'coord': [107.01262, 39.428127], 'time': '2022-03-04 17:18:46'}, {'coord': [107.012886, 39.42826], 'time': '2022-03-04 17:18:51'}, {'coord': [107.01311, 39.428303], 'time': '2022-03-04 17:18:56'}, {'coord': [107.01314, 39.428307], 'time': '2022-03-04 17:19:01'}, {'coord': [107.01314, 39.428307], 'time': '2022-03-04 17:19:06'}, {'coord': [107.013214, 39.42832], 'time': '2022-03-04 17:19:11'}, {'coord': [107.01336, 39.428314], 'time': '2022-03-04 17:19:16'}, {'coord': [107.01351, 39.428288], 'time': '2022-03-04 17:19:21'}, {'coord': [107.013664, 39.428257], 'time': '2022-03-04 17:19:26'}, {'coord': [107.0138, 39.428223], 'time': '2022-03-04 17:19:31'}, {'coord': [107.01395, 39.428192], 'time': '2022-03-04 17:19:36'}, {'coord': [107.01409, 39.42814], 'time': '2022-03-04 17:19:41'}, {'coord': [107.01421, 39.42808], 'time': '2022-03-04 17:19:46'}, {'coord': [107.014336, 39.428013], 'time': '2022-03-04 17:19:51'}]]
      const lines = data1.map(function (track) {
        return {
          coords: track.map(function (seg, idx) {
            return seg.coord;
          })
        };
      });

      const data = this.data;

      // const data = [
      //   { name: '海门', value: 9 },
      //   { name: '鄂尔多斯', value: 12 },
      //   { name: '招远', value: 12 },
      //   { name: '舟山', value: 12 },
      //   { name: '齐齐哈尔', value: 14 },
      //   { name: '盐城', value: 15 },
      //   { name: '赤峰', value: 16 },
      //   { name: '青岛', value: 18 },
      //   { name: '乳山', value: 18 },
      //   { name: '金昌', value: 19 },
      //   { name: '泉州', value: 21 },
      //   { name: '莱西', value: 21 },
      //   { name: '日照', value: 21 },
      //   { name: '胶南', value: 22 },
      //   { name: '南通', value: 23 },
      //   { name: '拉萨', value: 24 },
      //   { name: '云浮', value: 24 },
      //   { name: '梅州', value: 25 },
      //   { name: '文登', value: 25 },
      //   { name: '上海', value: 25 },
      //   { name: '攀枝花', value: 25 },
      //   { name: '威海', value: 25 },
      //   { name: '承德', value: 25 },
      //   { name: '厦门', value: 26 },
      //   { name: '汕尾', value: 26 },
      //   { name: '潮州', value: 26 },
      //   { name: '丹东', value: 27 },
      //   { name: '太仓', value: 27 },
      //   { name: '曲靖', value: 27 },
      //   { name: '烟台', value: 28 },
      //   { name: '福州', value: 29 },
      //   { name: '瓦房店', value: 30 },
      //   { name: '即墨', value: 30 },
      //   { name: '抚顺', value: 31 },
      //   { name: '玉溪', value: 31 },
      //   { name: '张家口', value: 31 },
      //   { name: '阳泉', value: 31 },
      //   { name: '莱州', value: 32 },
      //   { name: '湖州', value: 32 },
      //   { name: '汕头', value: 32 },
      //   { name: '昆山', value: 33 },
      //   { name: '宁波', value: 33 },
      //   { name: '湛江', value: 33 },
      //   { name: '揭阳', value: 34 },
      //   { name: '荣成', value: 34 },
      //   { name: '连云港', value: 35 },
      //   { name: '葫芦岛', value: 35 },
      //   { name: '常熟', value: 36 },
      //   { name: '东莞', value: 36 },
      //   { name: '河源', value: 36 },
      //   { name: '淮安', value: 36 },
      //   { name: '泰州', value: 36 },
      //   { name: '南宁', value: 37 },
      //   { name: '营口', value: 37 },
      //   { name: '惠州', value: 37 },
      //   { name: '江阴', value: 37 },
      //   { name: '蓬莱', value: 37 },
      //   { name: '韶关', value: 38 },
      //   { name: '嘉峪关', value: 38 },
      //   { name: '广州', value: 38 },
      //   { name: '延安', value: 38 },
      //   { name: '太原', value: 39 },
      //   { name: '清远', value: 39 },
      //   { name: '中山', value: 39 },
      //   { name: '昆明', value: 39 },
      //   { name: '寿光', value: 40 },
      //   { name: '盘锦', value: 40 },
      //   { name: '长治', value: 41 },
      //   { name: '深圳', value: 41 },
      //   { name: '珠海', value: 42 },
      //   { name: '宿迁', value: 43 },
      //   { name: '咸阳', value: 43 },
      //   { name: '铜川', value: 44 },
      //   { name: '平度', value: 44 },
      //   { name: '佛山', value: 44 },
      //   { name: '海口', value: 44 },
      //   { name: '江门', value: 45 },
      //   { name: '章丘', value: 45 },
      //   { name: '肇庆', value: 46 },
      //   { name: '大连', value: 47 },
      //   { name: '临汾', value: 47 },
      //   { name: '吴江', value: 47 },
      //   { name: '石嘴山', value: 49 },
      //   { name: '沈阳', value: 50 },
      //   { name: '苏州', value: 50 },
      //   { name: '茂名', value: 50 },
      //   { name: '嘉兴', value: 51 },
      //   { name: '长春', value: 51 },
      //   { name: '胶州', value: 52 },
      //   { name: '银川', value: 52 },
      //   { name: '张家港', value: 52 },
      //   { name: '三门峡', value: 53 },
      //   { name: '锦州', value: 54 },
      //   { name: '南昌', value: 54 },
      //   { name: '柳州', value: 54 },
      //   { name: '三亚', value: 54 },
      //   { name: '自贡', value: 56 },
      //   { name: '吉林', value: 56 },
      //   { name: '阳江', value: 57 },
      //   { name: '泸州', value: 57 },
      //   { name: '西宁', value: 57 },
      //   { name: '宜宾', value: 58 },
      //   { name: '呼和浩特', value: 58 },
      //   { name: '成都', value: 58 },
      //   { name: '大同', value: 58 },
      //   { name: '镇江', value: 59 },
      //   { name: '桂林', value: 59 },
      //   { name: '张家界', value: 59 },
      //   { name: '宜兴', value: 59 },
      //   { name: '北海', value: 60 },
      //   { name: '西安', value: 61 },
      //   { name: '金坛', value: 62 },
      //   { name: '东营', value: 62 },
      //   { name: '牡丹江', value: 63 },
      //   { name: '遵义', value: 63 },
      //   { name: '绍兴', value: 63 },
      //   { name: '扬州', value: 64 },
      //   { name: '常州', value: 64 },
      //   { name: '潍坊', value: 65 },
      //   { name: '重庆', value: 66 },
      //   { name: '台州', value: 67 },
      //   { name: '南京', value: 67 },
      //   { name: '滨州', value: 70 },
      //   { name: '贵阳', value: 71 },
      //   { name: '无锡', value: 71 },
      //   { name: '本溪', value: 71 },
      //   { name: '克拉玛依', value: 72 },
      //   { name: '渭南', value: 72 },
      //   { name: '马鞍山', value: 72 },
      //   { name: '宝鸡', value: 72 },
      //   { name: '焦作', value: 75 },
      //   { name: '句容', value: 75 },
      //   { name: '北京', value: 79 },
      //   { name: '徐州', value: 79 },
      //   { name: '衡水', value: 80 },
      //   { name: '包头', value: 80 },
      //   { name: '绵阳', value: 80 },
      //   { name: '乌鲁木齐', value: 84 },
      //   { name: '枣庄', value: 84 },
      //   { name: '杭州', value: 84 },
      //   { name: '淄博', value: 85 },
      //   { name: '鞍山', value: 86 },
      //   { name: '溧阳', value: 86 },
      //   { name: '库尔勒', value: 86 },
      //   { name: '安阳', value: 90 },
      //   { name: '开封', value: 90 },
      //   { name: '济南', value: 92 },
      //   { name: '德阳', value: 93 },
      //   { name: '温州', value: 95 },
      //   { name: '九江', value: 96 },
      //   { name: '邯郸', value: 98 },
      //   { name: '临安', value: 99 },
      //   { name: '兰州', value: 99 },
      //   { name: '沧州', value: 100 },
      //   { name: '临沂', value: 103 },
      //   { name: '南充', value: 104 },
      //   { name: '天津', value: 105 },
      //   { name: '富阳', value: 106 },
      //   { name: '泰安', value: 112 },
      //   { name: '诸暨', value: 112 },
      //   { name: '郑州', value: 113 },
      //   { name: '哈尔滨', value: 114 },
      //   { name: '聊城', value: 116 },
      //   { name: '芜湖', value: 117 },
      //   { name: '唐山', value: 119 },
      //   { name: '平顶山', value: 119 },
      //   { name: '邢台', value: 119 },
      //   { name: '德州', value: 120 },
      //   { name: '济宁', value: 120 },
      //   { name: '荆州', value: 127 },
      //   { name: '宜昌', value: 130 },
      //   { name: '义乌', value: 132 },
      //   { name: '丽水', value: 133 },
      //   { name: '洛阳', value: 134 },
      //   { name: '秦皇岛', value: 136 },
      //   { name: '株洲', value: 143 },
      //   { name: '石家庄', value: 147 },
      //   { name: '莱芜', value: 148 },
      //   { name: '常德', value: 152 },
      //   { name: '保定', value: 153 },
      //   { name: '湘潭', value: 154 },
      //   { name: '金华', value: 157 },
      //   { name: '岳阳', value: 169 },
      //   { name: '长沙', value: 175 },
      //   { name: '衢州', value: 177 },
      //   { name: '廊坊', value: 193 },
      //   { name: '菏泽', value: 194 },
      //   { name: '合肥', value: 229 },
      //   { name: '武汉', value: 273 },
      //   { name: '大庆', value: 279 }
      // ];
      const geoCoordMap = this.geoCoordMap;
      //     {
      //   海门: [121.15, 31.89],
      //   鄂尔多斯: [109.781327, 39.608266],
      //   招远: [120.38, 37.35],
      //   舟山: [122.207216, 29.985295],
      //   齐齐哈尔: [123.97, 47.33],
      //   盐城: [120.13, 33.38],
      //   赤峰: [118.87, 42.28],
      //   青岛: [120.33, 36.07],
      //   乳山: [121.52, 36.89],
      //   金昌: [102.188043, 38.520089],
      //   泉州: [118.58, 24.93],
      //   莱西: [120.53, 36.86],
      //   日照: [119.46, 35.42],
      //   胶南: [119.97, 35.88],
      //   南通: [121.05, 32.08],
      //   拉萨: [91.11, 29.97],
      //   云浮: [112.02, 22.93],
      //   梅州: [116.1, 24.55],
      //   文登: [122.05, 37.2],
      //   上海: [121.48, 31.22],
      //   攀枝花: [101.718637, 26.582347],
      //   威海: [122.1, 37.5],
      //   承德: [117.93, 40.97],
      //   厦门: [118.1, 24.46],
      //   汕尾: [115.375279, 22.786211],
      //   潮州: [116.63, 23.68],
      //   丹东: [124.37, 40.13],
      //   太仓: [121.1, 31.45],
      //   曲靖: [103.79, 25.51],
      //   烟台: [121.39, 37.52],
      //   福州: [119.3, 26.08],
      //   瓦房店: [121.979603, 39.627114],
      //   即墨: [120.45, 36.38],
      //   抚顺: [123.97, 41.97],
      //   玉溪: [102.52, 24.35],
      //   张家口: [114.87, 40.82],
      //   阳泉: [113.57, 37.85],
      //   莱州: [119.942327, 37.177017],
      //   湖州: [120.1, 30.86],
      //   汕头: [116.69, 23.39],
      //   昆山: [120.95, 31.39],
      //   宁波: [121.56, 29.86],
      //   湛江: [110.359377, 21.270708],
      //   揭阳: [116.35, 23.55],
      //   荣成: [122.41, 37.16],
      //   连云港: [119.16, 34.59],
      //   葫芦岛: [120.836932, 40.711052],
      //   常熟: [120.74, 31.64],
      //   东莞: [113.75, 23.04],
      //   河源: [114.68, 23.73],
      //   淮安: [119.15, 33.5],
      //   泰州: [119.9, 32.49],
      //   南宁: [108.33, 22.84],
      //   营口: [122.18, 40.65],
      //   惠州: [114.4, 23.09],
      //   江阴: [120.26, 31.91],
      //   蓬莱: [120.75, 37.8],
      //   韶关: [113.62, 24.84],
      //   嘉峪关: [98.289152, 39.77313],
      //   广州: [113.23, 23.16],
      //   延安: [109.47, 36.6],
      //   太原: [112.53, 37.87],
      //   清远: [113.01, 23.7],
      //   中山: [113.38, 22.52],
      //   昆明: [102.73, 25.04],
      //   寿光: [118.73, 36.86],
      //   盘锦: [122.070714, 41.119997],
      //   长治: [113.08, 36.18],
      //   深圳: [114.07, 22.62],
      //   珠海: [113.52, 22.3],
      //   宿迁: [118.3, 33.96],
      //   咸阳: [108.72, 34.36],
      //   铜川: [109.11, 35.09],
      //   平度: [119.97, 36.77],
      //   佛山: [113.11, 23.05],
      //   海口: [110.35, 20.02],
      //   江门: [113.06, 22.61],
      //   章丘: [117.53, 36.72],
      //   肇庆: [112.44, 23.05],
      //   大连: [121.62, 38.92],
      //   临汾: [111.5, 36.08],
      //   吴江: [120.63, 31.16],
      //   石嘴山: [106.39, 39.04],
      //   沈阳: [123.38, 41.8],
      //   苏州: [120.62, 31.32],
      //   茂名: [110.88, 21.68],
      //   嘉兴: [120.76, 30.77],
      //   长春: [125.35, 43.88],
      //   胶州: [120.03336, 36.264622],
      //   银川: [106.27, 38.47],
      //   张家港: [120.555821, 31.875428],
      //   三门峡: [111.19, 34.76],
      //   锦州: [121.15, 41.13],
      //   南昌: [115.89, 28.68],
      //   柳州: [109.4, 24.33],
      //   三亚: [109.511909, 18.252847],
      //   自贡: [104.778442, 29.33903],
      //   吉林: [126.57, 43.87],
      //   阳江: [111.95, 21.85],
      //   泸州: [105.39, 28.91],
      //   西宁: [101.74, 36.56],
      //   宜宾: [104.56, 29.77],
      //   呼和浩特: [111.65, 40.82],
      //   成都: [104.06, 30.67],
      //   大同: [113.3, 40.12],
      //   镇江: [119.44, 32.2],
      //   桂林: [110.28, 25.29],
      //   张家界: [110.479191, 29.117096],
      //   宜兴: [119.82, 31.36],
      //   北海: [109.12, 21.49],
      //   西安: [108.95, 34.27],
      //   金坛: [119.56, 31.74],
      //   东营: [118.49, 37.46],
      //   牡丹江: [129.58, 44.6],
      //   遵义: [106.9, 27.7],
      //   绍兴: [120.58, 30.01],
      //   扬州: [119.42, 32.39],
      //   常州: [119.95, 31.79],
      //   潍坊: [119.1, 36.62],
      //   重庆: [106.54, 29.59],
      //   台州: [121.420757, 28.656386],
      //   南京: [118.78, 32.04],
      //   滨州: [118.03, 37.36],
      //   贵阳: [106.71, 26.57],
      //   无锡: [120.29, 31.59],
      //   本溪: [123.73, 41.3],
      //   克拉玛依: [84.77, 45.59],
      //   渭南: [109.5, 34.52],
      //   马鞍山: [118.48, 31.56],
      //   宝鸡: [107.15, 34.38],
      //   焦作: [113.21, 35.24],
      //   句容: [119.16, 31.95],
      //   北京: [116.46, 39.92],
      //   徐州: [117.2, 34.26],
      //   衡水: [115.72, 37.72],
      //   包头: [110, 40.58],
      //   绵阳: [104.73, 31.48],
      //   乌鲁木齐: [87.68, 43.77],
      //   枣庄: [117.57, 34.86],
      //   杭州: [120.19, 30.26],
      //   淄博: [118.05, 36.78],
      //   鞍山: [122.85, 41.12],
      //   溧阳: [119.48, 31.43],
      //   库尔勒: [86.06, 41.68],
      //   安阳: [114.35, 36.1],
      //   开封: [114.35, 34.79],
      //   济南: [117, 36.65],
      //   德阳: [104.37, 31.13],
      //   温州: [120.65, 28.01],
      //   九江: [115.97, 29.71],
      //   邯郸: [114.47, 36.6],
      //   临安: [119.72, 30.23],
      //   兰州: [103.73, 36.03],
      //   沧州: [116.83, 38.33],
      //   临沂: [118.35, 35.05],
      //   南充: [106.110698, 30.837793],
      //   天津: [117.2, 39.13],
      //   富阳: [119.95, 30.07],
      //   泰安: [117.13, 36.18],
      //   诸暨: [120.23, 29.71],
      //   郑州: [113.65, 34.76],
      //   哈尔滨: [126.63, 45.75],
      //   聊城: [115.97, 36.45],
      //   芜湖: [118.38, 31.33],
      //   唐山: [118.02, 39.63],
      //   平顶山: [113.29, 33.75],
      //   邢台: [114.48, 37.05],
      //   德州: [116.29, 37.45],
      //   济宁: [116.59, 35.38],
      //   荆州: [112.239741, 30.335165],
      //   宜昌: [111.3, 30.7],
      //   义乌: [120.06, 29.32],
      //   丽水: [119.92, 28.45],
      //   洛阳: [112.44, 34.7],
      //   秦皇岛: [119.57, 39.95],
      //   株洲: [113.16, 27.83],
      //   石家庄: [114.48, 38.03],
      //   莱芜: [117.67, 36.19],
      //   常德: [111.69, 29.05],
      //   保定: [115.48, 38.85],
      //   湘潭: [112.91, 27.87],
      //   金华: [119.64, 29.12],
      //   岳阳: [113.09, 29.37],
      //   长沙: [113, 28.21],
      //   衢州: [118.88, 28.97],
      //   廊坊: [116.7, 39.53],
      //   菏泽: [115.480656, 35.23375],
      //   合肥: [117.27, 31.86],
      //   武汉: [114.31, 30.52],
      //   大庆: [125.03, 46.58]
      // };
      const convertData = function (data) {
        var res = [];
        for (var i = 0; i < data.length; i++) {
          var geoCoord = geoCoordMap[data[i].name];
          if (geoCoord) {
            res.push({
              name: data[i].name,
              value: geoCoord.concat(data[i].value)
            });
          }
        }
        return res;
      };


      var chartDom = document.getElementById("bmap");

      var myChart = this.$echarts.init(chartDom);

      global_charts = chartDom;
      var option ;


      option = {
        backgroundColor: 'transparent',
        title: {
          text: '露天矿实时轨迹数据图',
          subtext: '',
          subtextStyle:{
            color:'#000',
            align:'right',
            fontSize:20
          },
          sublink: 'http://www.pm25.in',
          left: 'center',
          textStyle: {
            color: '#000',
            fontSize: 25
          }
        },
        tooltip : {
          trigger: 'item'
        },
        bmap: {
          // center: [104.114129, 37.550339],
          // center:[106.94022939015291,39.47474585684117],
          center:this.areacenter,
          zoom: 15,
          roam: true,
          mapStyle: {
            style:'dark',
            styleJson: [
              {
                "featureType": "water",
                "elementType": "all",
                "stylers": {
                  "color": "#044161"
                }
              },
              {
                "featureType": "land",
                "elementType": "all",
                "stylers": {
                  "color": "#004981"
                }
              },
              {
                "featureType": "boundary",
                "elementType": "geometry",
                "stylers": {
                  "color": "#064f85"
                }
              },
              {
                "featureType": "railway",
                "elementType": "all",
                "stylers": {
                  "visibility": "off"
                }
              },
              {
                "featureType": "highway",
                "elementType": "geometry",
                "stylers": {
                  "color": "#004981",
                  "visibility": "off"
                }
              },
              {
                "featureType": "highway",
                "elementType": "geometry.fill",
                "stylers": {
                  "color": "#005b96",
                  "lightness": 1,
                  "visibility": "off"
                }
              },
              {
                "featureType": "highway",
                "elementType": "labels",
                "stylers": {
                  "visibility": "off"
                }
              },
              {
                "featureType": "arterial",
                "elementType": "geometry",
                "stylers": {
                  "color": "#004981"
                }
              },
              {
                "featureType": "arterial",
                "elementType": "geometry.fill",
                "stylers": {
                  "color": "#00508b"
                }
              },
              {
                "featureType": "poi",
                "elementType": "all",
                "stylers": {
                  "visibility": "off"
                }
              },
              {
                "featureType": "green",
                "elementType": "all",
                "stylers": {
                  "color": "#056197",
                  "visibility": "off"
                }
              },
              {
                "featureType": "subway",
                "elementType": "all",
                "stylers": {
                  "visibility": "off"
                }
              },
              {
                "featureType": "manmade",
                "elementType": "all",
                "stylers": {
                  "visibility": "off"
                }
              },
              {
                "featureType": "local",
                "elementType": "all",
                "stylers": {
                  "visibility": "off"
                }
              },
              {
                "featureType": "arterial",
                "elementType": "labels",
                "stylers": {
                  "visibility": "off"
                }
              },
              {
                "featureType": "boundary",
                "elementType": "geometry.fill",
                "stylers": {
                  "color": "#029fd4"
                }
              },
              {
                "featureType": "building",
                "elementType": "all",
                "stylers": {
                  "color": "#1a5787"
                }
              },
              {
                "featureType": "label",
                "elementType": "all",
                "stylers": {
                  "visibility": "off"
                }
              }
            ]
          }
        },
        series : [
          {
            name:'区域',
            type: 'custom',
            coordinateSystem: 'bmap',
            renderItem: this.renderItem,
            itemStyle: {
              opacity: 0.5
            },
            animation: false,
            silent: true,
            data: [0],
            z: -10,
            label:{
              show:true,
              formatter: (params) => {
                // params.data.name 城市名称
                // params.data.value[2] 空气质量指数数据
                return '采坑'
                // return `${params.name} - ${params.type}`
              }
            },

          },
          {
            type: 'lines',
            coordinateSystem: 'bmap',
            data: lines,
            polyline: true,
            lineStyle: {
              color: 'purple',
              opacity: 0.6,
              width: 3

            },
            lable:{
              position :'end'
            },


          },
              //单个车辆的行车轨迹
          {
            type: 'lines',
            coordinateSystem: 'bmap',
            data: lines,
            polyline: true,
            lineStyle: {
              // color: 'purple',
              // opacity: 0.6,
              // width: 3
              width: 0
            },
            lable:{
              position :'end'
            },
            effect: {
              constantSpeed: 20,
              show: true,
              trailLength: 0.5,
              symbolSize: 10
            },
            zlevel: 1
          },

            ////车辆散点图
          {
            name: '车辆',
            type: 'scatter',
            coordinateSystem: 'bmap',
            data: convertData(data),
            symbolSize: function (val) {
              return val[2] *2;
            },
            encode: {
              value: 2
            },
            label: {
              formatter: '{b}',
              position: 'right',
              show: false
            },
            emphasis: {
              label: {
                show: true
              }
            }
          },
        ]
      };
      global_option = option;
      if (option && typeof option === 'object') {
        myChart.setOption(option);
      }

    },



    initBmap () {
      // const myChart = this.$echarts.init(this.$refs.bmap)
      // myChart.setOption({
      //   bmap: {
      //     key: 'EQGnPyIUtYnlvEMj42bGWmuiAwPRX9Uc',
      //     center: [104.114129, 37.550339] // 当前视角中心位置的坐标
      //   }
      // })


      // 计算停留地

      const datalist = [

        { name: '盛唐超市'},

        { name: '李宁'},

        { name: '杏花小区'},

      ]

      // 设置停留地

      const geoCoordMaplist = {

        盛唐超市: [117.492455,30.657639],

        李宁: [117.494222,30.657299],

        杏花小区: [117.495955,30.657639],

      }



      // 轨迹

      var moveLine = {

        normal: [

          {"from": "2021-10-9","to": "2021-11-1",'coords': [[117.492455,30.657639],[117.494222,30.657299]]},

          {"fromName": "2021-9-10","toName":"2021-10-1",'coords': [[117.494222,30.657299],[117.495955,30.657639]]},

          {"fromName": "盛唐超市","toName": "李宁",'coords': [[117.495955,30.657639],[117.494222,30.657299]]},

        ]

      };

      var chartDom = document.getElementById("bmap");

      var myChart = this.$echarts.init(chartDom);

      var option;

      const data = datalist;

      const geoCoordMap = geoCoordMaplist;

      const convertData = function(data) {

        var res = [];

        for (var i = 0; i < data.length; i++) {

          var geoCoord = geoCoordMap[data[i].name];

          if (geoCoord) {

            res.push({

              name: data[i].name,

              value: geoCoord.concat(data[i].value)

            });

          }

        }

        return res;

      };

      option = {

        tooltip: {

          trigger: "item"

        },

        bmap: {     //百度地图的设置

          // center: [106.94469169966294, 39.465399342663204],
          center: this.mapcenter,
          // center: [117.492455,30.657639],

          zoom: 18,                //缩放比例

          roam: true,                //是否可以缩放

          mapStyle: {                // 类型设置 可以改变地图的主题



            // styleJson: this.mapJson

          }

        },

        series: [

          {

            name: "停留点",

            type: "effectScatter",     // 涟漪效果

            coordinateSystem: "bmap", // 依赖的坐标轴

            data: convertData(data),   // 获取的数据

            symbolSize: 10,        // 散点的大小

            encode: {

              value: 2

            },

            showEffectOn: "render",  //散点涟漪的样式

            rippleEffect: {

              brushType: "stroke"

            },

            label: {       // 显示文字

              formatter: "{b}",

              position: "right",

              show: true

            },

            itemStyle: {

              color: "#fcf67b",

              shadowBlur: 10,

              shadowColor: "#333"

            },

            emphasis: {

              scale: true

            },

            zlevel: 1

          },

          // 射线样式

          {

            type: "lines",

            coordinateSystem: "bmap",

            zlevel: 2, //数值越大越在上面

            large: true,

            symbol: ["none", "arrow"],

            effect: {

              show: true,

              period: 6,

              constantSpeed: 30,

              trailLength: 0,

              symbolSize: 3 //圆点大小

            },

            lineStyle: {

              // 线条颜色

              color: "#fcf67b",

              opacity: 0.6,

              curveness: 0.2

            },

            data: moveLine.normal

          },

          // 射线样式

          {

            type: "lines",

            coordinateSystem: "bmap",

            zlevel: 3,

            large: true,

            effect: {

              show: true,

              period: 5,

              trailLength: 0.8, //特效尾迹的长度

              color: "#fff",

              symbolSize: 3 //圆点大小

            },

            lineStyle: {

              color: "#fcf67b",

              curveness: 0.2

            },

            data: moveLine.normal

          }

        ]

      };

      // option && myChart.setOption(option);









 //      var uploadedDataURL = "public/china.json";
 //      var points = [
 //        {
 //          value: [118.8062, 31.9208], itemStyle: {color: '#4ab2e5'}
 //        }
 //        , {value: [127.9688, 45.368], itemStyle: {color: '#4fb6d2'}}
 //        , {value: [110.3467, 41.4899], itemStyle: {color: '#52b9c7'}}
 //        , {value: [125.8154, 44.2584], itemStyle: {color: '#5abead'}}
 //        , {value: [116.4551, 40.2539], itemStyle: {color: '#f34e2b'}}
 //        , {value: [123.1238, 42.1216], itemStyle: {color: '#f56321'}}
 //        , {value: [114.4995, 38.1006], itemStyle: {color: '#f56f1c'}}
 //        , {value: [117.4219, 39.4189], itemStyle: {color: '#f58414'}}
 //        , {value: [112.3352, 37.9413], itemStyle: {color: '#f58f0e'}}
 //        , {value: [109.1162, 34.2004], itemStyle: {color: '#f5a305'}}
 //        , {value: [103.5901, 36.3043], itemStyle: {color: '#e7ab0b'}}
 //        , {value: [106.3586, 38.1775], itemStyle: {color: '#dfae10'}}
 //        , {value: [101.4038, 36.8207], itemStyle: {color: '#d5b314'}}
 //        , {value: [103.9526, 30.7617], itemStyle: {color: '#c1bb1f'}}
 //        , {value: [108.384366, 30.439702], itemStyle: {color: '#b9be23'}}
 //        , {value: [113.0823, 28.2568], itemStyle: {color: '#a6c62c'}}
 //        , {value: [102.9199, 25.46639], itemStyle: {color: '#96cc34'}}
 //        , {
 //          value: [119.4543, 25.9222]
 //        }
 //      ]
 //
 //      var myChart = this.$echarts.init(document.getElementById('bmap'))
 //      myChart.showLoading();
 //
 //      let index = -1;
 //
 //      var option;
 //      // this.$.getJSON("file:///E:/bishe/china.json", function (geoJson) {
 //      // this.$http.get('static/map/china.json', function(geoJson){
 //      ///获取本机json文件
 //      let geoJson = require('../../../static/map/china.json');
 //      this.$echarts.registerMap('china', geoJson);
 //      myChart.hideLoading();
 //      option = {
 //        backgroundColor: '#013954',
 //        geo: {
 //          map: 'china',
 //          aspectScale: 0.75, //长宽比
 //          zoom: 1.1,
 //          roam: false,
 //          itemStyle: {
 //            normal: {
 //              areaColor: {
 //                type: 'radial',
 //                x: 0.5,
 //                y: 0.5,
 //                r: 0.8,
 //                colorStops: [{
 //                  offset: 0,
 //                  color: '#09132c' // 0% 处的颜色
 //                }, {
 //                  offset: 1,
 //                  color: '#274d68'  // 100% 处的颜色
 //                }],
 //                globalCoord: true // 缺省为 false
 //              },
 //              shadowColor: 'rgb(58,115,192)',
 //              shadowOffsetX: 10,
 //              shadowOffsetY: 11
 //            },
 //            emphasis: {
 //              areaColor: '#2AB8FF',
 //              borderWidth: 0,
 //              color: 'green',
 //              label: {
 //                show: false
 //              }
 //            }
 //          },
 //          regions: [{
 //            name: '南海诸岛',
 //            itemStyle: {
 //              areaColor: 'rgba(0, 10, 52, 1)',
 //
 //              borderColor: 'rgba(0, 10, 52, 1)',
 //              normal: {
 //                opacity: 0,
 //                label: {
 //                  show: false,
 //                  color: "#009cc9",
 //                }
 //              }
 //            },
 //
 //
 //          }],
 //        },
 //        series: [{
 //          type: 'map',
 //          roam: false,
 //          label: {
 //            normal: {
 //              show: true,
 //              textStyle: {
 //                color: '#1DE9B6'
 //              }
 //            },
 //            emphasis: {
 //              textStyle: {
 //                color: 'rgb(183,185,14)'
 //              }
 //            }
 //          },
 //
 //          itemStyle: {
 //            normal: {
 //              borderColor: 'rgb(147, 235, 248)',
 //              borderWidth: 1,
 //              areaColor: {
 //                type: 'radial',
 //                x: 0.5,
 //                y: 0.5,
 //                r: 0.8,
 //                colorStops: [{
 //                  offset: 0,
 //                  color: '#09132c' // 0% 处的颜色
 //                }, {
 //                  offset: 1,
 //                  color: '#274d68'  // 100% 处的颜色
 //                }],
 //                globalCoord: true // 缺省为 false
 //              },
 //            },
 //            emphasis: {
 //              areaColor: 'rgb(46,229,206)',
 //              //    shadowColor: 'rgb(12,25,50)',
 //              borderWidth: 0.1
 //            }
 //          },
 //          zoom: 1.1,
 //          //     roam: false,
 //          map: 'china' //使用
 //          // data: this.difficultData //热力图数据   不同区域 不同的底色
 //        }, {
 //          type: 'effectScatter',
 //          coordinateSystem: 'geo',
 //          showEffectOn: 'render',
 //          zlevel: 1,
 //          rippleEffect: {
 //            period: 15,
 //            scale: 4,
 //            brushType: 'fill'
 //          },
 //          hoverAnimation: true,
 //          label: {
 //            normal: {
 //              formatter: '{b}',
 //              position: 'right',
 //              offset: [15, 0],
 //              color: '#1DE9B6',
 //              show: true
 //            },
 //          },
 //          itemStyle: {
 //            normal: {
 //              color: '#1DE9B6'/* function (value){ //随机颜色
 // return "#"+("00000"+((Math.random()*16777215+0.5)>>0).toString(16)).slice(-6);
 // }*/,
 //              shadowBlur: 10,
 //              shadowColor: '#333'
 //            }
 //          },
 //          symbolSize: 12,
 //          data: points
 //        }, //地图线的动画效果
 //          {
 //            type: 'lines',
 //            zlevel: 2,
 //            effect: {
 //              show: true,
 //              period: 4, //箭头指向速度，值越小速度越快
 //              trailLength: 0.4, //特效尾迹长度[0,1]值越大，尾迹越长重
 //              symbol: 'arrow', //箭头图标
 //              symbolSize: 7, //图标大小
 //            },
 //            lineStyle: {
 //              normal: {
 //                color: '#1DE9B6'
 //                /* function (value){ //随机颜色
 //
 //                  ['#f21347','#f3243e','#f33736','#f34131','#f34e2b',
 //                  '#f56321','#f56f1c','#f58414','#f58f0e','#f5a305',
 //                  '#e7ab0b','#dfae10','#d5b314','#c1bb1f','#b9be23',
 //                  '#a6c62c','#96cc34','#89d23b','#7ed741','#77d64c',
 //                  '#71d162','#6bcc75','#65c78b','#5fc2a0','#5abead',
 //                  '#52b9c7','#4fb6d2','#4ab2e5']
 //      return "#"+("00000"+((Math.random()*16777215+0.5)>>0).toString(16)).slice(-6);
 //      }*/,
 //                width: 1, //线条宽度
 //                opacity: 0.1, //尾迹线条透明度
 //                curveness: .3 //尾迹线条曲直度
 //              }
 //            },
 //            data: [
 //              {coords: [[118.8062, 31.9208], [119.4543, 25.9222]], lineStyle: {color: '#4ab2e5'}}
 //              , {coords: [[127.9688, 45.368], [119.4543, 25.9222]], lineStyle: {color: '#4fb6d2'}}
 //              , {coords: [[110.3467, 41.4899], [119.4543, 25.9222]], lineStyle: {color: '#52b9c7'}}
 //              , {coords: [[125.8154, 44.2584], [119.4543, 25.9222]], lineStyle: {color: '#5abead'}}
 //              , {coords: [[116.4551, 40.2539], [119.4543, 25.9222]], lineStyle: {color: '#f34e2b'}}
 //              , {coords: [[123.1238, 42.1216], [119.4543, 25.9222]], lineStyle: {color: '#f56321'}}
 //              , {coords: [[114.4995, 38.1006], [119.4543, 25.9222]], lineStyle: {color: '#f56f1c'}}
 //              , {coords: [[117.4219, 39.4189], [119.4543, 25.9222]], lineStyle: {color: '#f58414'}}
 //              , {coords: [[112.3352, 37.9413], [119.4543, 25.9222]], lineStyle: {color: '#f58f0e'}}
 //              , {coords: [[109.1162, 34.2004], [119.4543, 25.9222]], lineStyle: {color: '#f5a305'}}
 //              , {coords: [[103.5901, 36.3043], [119.4543, 25.9222]], lineStyle: {color: '#e7ab0b'}}
 //              , {coords: [[106.3586, 38.1775], [119.4543, 25.9222]], lineStyle: {color: '#dfae10'}}
 //              , {coords: [[101.4038, 36.8207], [119.4543, 25.9222]], lineStyle: {color: '#d5b314'}}
 //              , {coords: [[103.9526, 30.7617], [119.4543, 25.9222]], lineStyle: {color: '#c1bb1f'}}
 //              , {coords: [[108.384366, 30.439702], [119.4543, 25.9222]], lineStyle: {color: '#b9be23'}}
 //              , {coords: [[113.0823, 28.2568], [119.4543, 25.9222]], lineStyle: {color: '#a6c62c'}}
 //              , {coords: [[102.9199, 25.46639], [119.4543, 25.9222]], lineStyle: {color: '#96cc34'}}
 //            ]
 //          }
 //
 //        ]
 //      };
 //      myChart.setOption(option, true);



    },




  }
}



</script>
<style>
.anchorBL{
  display:none
}
.container1{

  height: 100%;
}
.bmap{
  position: absolute;
  left: 28.5%;
  width: 70%;
  height: 86%;
  margin-bottom: 15px;
}

.left{
  position: absolute;
  width: 28%;
  height: 100%;
}
.left-top{
  width: 80%;
  height: 40%;
}
.date{
  z-index: 111;
  position: absolute;
  left:80%;
  width:200px;
  font-size: 15px;

}
</style>